[LiveUpdate_FormLiveUpdateMain]
btnClose.Hint=סגירה
btnUpdate.Caption=הורד
btnConfirmCancel.Caption=ביטול
btnUptoDateOK.Caption=אוקיי
lblUpToDate.Caption=ברכות! יש לך כבר את הגירסה האחרונה. אין עדכון זמין
lblGetUptInfo.Caption=מקבל מידע עדכון, נא להמתין...
btnConfigCancel.Caption=ביטול
btnMinimize.Caption=צזער
btnProcessCancel.Caption=ביטול
btnUptWeb.Caption=עדכן כעת
btnWebCancel.Caption=עדכן אחר כך
lblUpdateFailed.Caption=העדכון נכשל! נא לנסות מאוחר יותר או הקלק על כפתור נסה שוב כדי לעדכן שוב
btnFailedClose.Caption=סגירה
btnRetry.Caption=נסה שוב
btnSuccessClose.Caption=אוקיי

[LiveUpdate_M]
Item=פריט
Size=גודל
Version=גירסה
DownLoading=מוריד
OK=אוקיי
Close=סגירה
LiveUpdate=עדכון
UpdateSuccess=עודכנו %s - אתה יכול ליהנות מהתכונות והשיפורים האחרונים כעת
WebDownLoad=גירסה חדשה של %s זמינה. נא לעדכן כעת להשגת התכונות והשיפורים האחרונים. זה בלי תשלום
AvailableUpdates=עדכונים זמינים
NewVersion=גירסה חדשה
VersionUpdate=עדכון גירסה
ImportantUpdate=עדכון חשוב

